{
    "en": "h1(The Oblit Philosophy)\nh3(It's not just code, it's a methodology.)\n\nh2(1. Minimalism is a Feature, Not a Lack)\nWe believe that less code leads to fewer bugs, a smaller attack surface, and inherently higher performance. The Oblit core is intentionally small. Every function has a purpose.\n\n![tip](A smaller codebase is easier to audit for security. With zero dependencies, Oblit's entire surface can be reviewed in minutes.)!++\n\nh2(2. Performance Over Convenience)\nJSON is easy, but it's slow. Oblit's true power lies in **manual binary packing**. We challenge developers to think at the byte level.\n\n*   A 3D coordinate as `{ \"x\": 1.0, \"y\": 2.0, \"z\": 3.0 }` is 28 bytes.\n*   As three 4-byte floats, it's only **12 bytes**.\n\nThis **57% saving** on a single message, when sent 60 times a second by 1000 players, saves gigabytes of traffic.\n\nh2(3. Fail Safely, Not Loudly)\nA server should **never crash** because of a misbehaving client. Oblit is designed with a \"crash-free\" architecture. Malformed packets or abrupt disconnections are handled gracefully.",
    "tr": "h1(Oblit Felsefesi)\nh3(Bu sadece bir kod değil, bir metodolojidir.)\n\nh2(1. Minimalizm Bir Özelliktir, Eksiklik Değil)\nDaha az kodun daha az hataya ve daha yüksek performansa yol açtığına inanıyoruz. Oblit çekirdeği kasıtlı olarak küçüktür. Her fonksiyonun bir amacı vardır.\n\n![tip](Daha küçük bir kod tabanını güvenlik açısından denetlemek daha kolaydır. Sıfır bağımlılık ile Oblit'in tümü dakikalar içinde incelenebilir.)!++\n\nh2(2. Kolaylık Değil, Performans Önceliklidir)\nJSON kolaydır, ama yavaştır. Oblit'in gerçek gücü **manuel binary paketlemede** yatar. Geliştiricileri bayt seviyesinde düşünmeye davet ediyoruz.\n\n*   Bir 3D koordinatı `{ \"x\": 1.0, \"y\": 2.0, \"z\": 3.0 }` olarak göndermek 28 bayttır.\n*   Üç adet 4 baytlık float olarak göndermek ise sadece **12 bayttır**.\n\nTek bir mesajdaki bu **%57'lik tasarruf**, saniyede 60 kez 1000 oyuncu tarafından gönderildiğinde, gigabaytlarca trafik tasarrufu sağlar.\n\nh2(3. Gürültülü Değil, Güvenli Hata Yönetimi)\nBir sunucu, kötü niyetli bir istemci yüzünden **asla çökmemelidir**. Oblit, \"çökmesiz\" bir mimari ile tasarlanmıştır. Bozuk paketler veya ani bağlantı kesintileri zarif bir şekilde ele alınır."
}